OpenFOAM/WFD_OpenFOAM/cases/batch_20260528_104510_fa7b09/pitch_8p5_wider_chord/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    rotatingCells;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            point1  (0 0 -0.08);
            point2  (0 0  0.08);
            radius  0.105;
        }
    }
    {
        name    rotorZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     rotatingCells;
        }
    }
);

// ************************************************************************* //
